#### DataConversionMonitorScope Members

---

|  |
| --- |
| DataConversionMonitorScope Class   Constructors   Methods   Properties   See Also |

The  DataConversionMonitorScope  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DataConversionMonitorScope | The only constructor. Expects a valid pointer to IDataConversionMonitor. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DataConversionMonitorScope |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DataConversionMonitorScope Class

Autodesk.Revit.DB Namespace